benchmarks/final_opt_6.7b_A6000_math500/baseline_1_0_12_math500_output.txt
INFO 06-15 01:28:58 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=12.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': True}
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     2171      
Benchmark duration (s):                  300.34    
Total input tokens:                      155073    
Total generated tokens:                  463143    
Request throughput (req/s):              7.23      
Output token throughput (tok/s):         1542.08   
Total Token throughput (tok/s):          2058.42   
---------------Time to First Token----------------
Mean TTFT (ms):                          35568.16  
Median TTFT (ms):                        36149.16  
P99 TTFT (ms):                           91934.87  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          105.12    
Median TPOT (ms):                        105.91    
P99 TPOT (ms):                           145.54    
---------------Inter-token Latency----------------
Mean ITL (ms):                           195.37    
Median ITL (ms):                         175.96    
P99 ITL (ms):                            484.83    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          57376.47  
Median E2EL (ms):                        57011.42  
P99 E2EL (ms):                           127882.02 
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 404.90    
Median Token Latency (ms):               272.18    
P99 Token Latency (ms):                  1912.39   
==================================================